{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\2025\CEU\Degree program\Coding for Economists\Assignment\Coding_Final_Assignment.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Nov 2025, 14:17:39
{txt}
{com}. 
. 
. import delimited "D:\2025\CEU\Degree program\Coding for Economists\Assignment\data\airbnb_raw.csv", clear
{res}{text}(166 vars, 110,041 obs)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. //Working directory -> change WD to another path
. pwd // get your working directory 
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. help pwd
{txt}
{com}. cd "D:\2025\CEU\Degree program\Coding for Economists\Assignment"
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. pwd
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. 
. // Create a log file 
. //capture log close // make sure nothing is open
. //log using "Coding_Final_Assignment", replace
. 
. 
. import delimited "D:\2025\CEU\Degree program\Coding for Economists\Assignment\data\airbnb_raw.csv", clear
{res}{text}(166 vars, 110,041 obs)

{com}. 
. 
. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. list in 1

     {txt}{c TLC}{hline 4}{c TT}{hline 13}{c TT}{hline 11}{c TT}{hline 14}{c TT}{hline 6}{c TT}{hline 9}{c TRC}
  1. {c |} v1 {c |}          v2 {c |}        v3 {c |}           v4 {c |}   v5 {c |}      v6 {c |}
     {c |} {res}id {txt}{c |} {res}listing_url {txt}{c |} {res}scrape_id {txt}{c |} {res}last_scraped {txt}{c |} {res}name {txt}{c |} {res}summary {txt}{c |}
     {c LT}{hline 4}{c BT}{hline 8}{c TT}{hline 4}{c BT}{hline 11}{c BT}{hline 2}{c TT}{hline 11}{c BT}{hline 6}{c BT}{hline 9}{c RT}
     {c |}       v7    {c |}             v8    {c |}                     v9     {c |}
     {c |}    {res}space    {txt}{c |}    {res}description    {txt}{c |}    {res}experiences_offered     {txt}{c |}
     {c LT}{hline 13}{c BT}{hline 12}{c TT}{hline 6}{c BT}{hline 3}{c TT}{hline 12}{c TT}{hline 11}{c RT}
     {c |}                    v10   {c |}    v11   {c |}      v12   {c |}     v13   {c |}
     {c |}  {res}neighborhood_overview   {txt}{c |}  {res}notes   {txt}{c |}  {res}transit   {txt}{c |}  {res}access   {txt}{c |}
     {c LT}{hline 14}{c TT}{hline 11}{c BT}{hline 2}{c TT}{hline 7}{c BT}{hline 9}{c TT}{hline 2}{c BT}{hline 11}{c RT}
     {c |}         v14  {c |}         v15  {c |}            v16  {c |}         v17  {c |}
     {c |} {res}interaction  {txt}{c |} {res}house_rules  {txt}{c |}  {res}thumbnail_url  {txt}{c |}  {res}medium_url  {txt}{c |}
     {c LT}{hline 14}{c BT}{c TT}{hline 13}{c BT}{hline 5}{c TT}{hline 11}{c BT}{c TT}{hline 13}{c RT}
     {c |}          v18  {c |}             v19   {c |}      v20   {c |}       v21   {c |}
     {c |}  {res}picture_url  {txt}{c |}  {res}xl_picture_url   {txt}{c |}  {res}host_id   {txt}{c |}  {res}host_url   {txt}{c |}
     {c LT}{hline 13}{c TT}{hline 1}{c BT}{hline 12}{c TT}{hline 6}{c BT}{hline 10}{c TT}{hline 1}{c BT}{hline 13}{c RT}
     {c |}        v22  {c |}         v23  {c |}            v24  {c |}         v25   {c |}
     {c |}  {res}host_name  {txt}{c |}  {res}host_since  {txt}{c |}  {res}host_location  {txt}{c |}  {res}host_about   {txt}{c |}
     {c LT}{hline 13}{c BT}{hline 14}{c BT}{hline 1}{c TT}{hline 15}{c BT}{hline 15}{c RT}
     {c |}                     v26      {c |}                     v27       {c |}
     {c |}      {res}host_response_time      {txt}{c |}      {res}host_response_rate       {txt}{c |}
     {c LT}{hline 30}{c BT}{hline 1}{c TT}{hline 29}{c RT}
     {c |}                       v28      {c |}                    v29      {c |}
     {c |}      {res}host_acceptance_rate      {txt}{c |}      {res}host_is_superhost      {txt}{c |}
     {c LT}{hline 20}{c TT}{hline 11}{c BT}{hline 7}{c TT}{hline 21}{c RT}
     {c |}                v30 {c |}              v31  {c |}                v32  {c |}
     {c |} {res}host_thumbnail_url {txt}{c |} {res}host_picture_url  {txt}{c |} {res}host_neighbourhood  {txt}{c |}
     {c LT}{hline 20}{c BT}{hline 6}{c TT}{hline 12}{c BT}{hline 21}{c RT}
     {c |}                    v33    {c |}                          v34     {c |}
     {c |}    {res}host_listings_count    {txt}{c |}    {res}host_total_listings_count     {txt}{c |}
     {c LT}{hline 27}{c BT}{hline 1}{c TT}{hline 32}{c RT}
     {c |}                    v35      {c |}                       v36      {c |}
     {c |}     {res}host_verifications      {txt}{c |}      {res}host_has_profile_pic      {txt}{c |}
     {c LT}{hline 28}{c TT}{c BT}{hline 11}{c TT}{hline 20}{c RT}
     {c |}                      v37   {c |}      v38   {c |}             v39    {c |}
     {c |}   {res}host_identity_verified   {txt}{c |}   {res}street   {txt}{c |}   {res}neighbourhood    {txt}{c |}
     {c LT}{hline 24}{c TT}{hline 3}{c BT}{hline 12}{c BT}{hline 13}{c TT}{hline 6}{c RT}
     {c |}                    v40 {c |}                          v41 {c |}  v42 {c |}
     {c |} {res}neighbourhood_cleansed {txt}{c |} {res}neighbourhood_group_cleansed {txt}{c |} {res}city {txt}{c |}
     {c LT}{hline 7}{c TT}{hline 10}{c TT}{hline 5}{c BT}{hline 3}{c TT}{hline 17}{c TT}{hline 8}{c BT}{hline 6}{c RT}
     {c |}   v43 {c |}     v44  {c |}    v45  {c |}            v46  {c |}          v47  {c |}
     {c |} {res}state {txt}{c |} {res}zipcode  {txt}{c |} {res}market  {txt}{c |} {res}smart_location  {txt}{c |} {res}country_code  {txt}{c |}
     {c LT}{hline 7}{c BT}{hline 3}{c TT}{hline 6}{c BT}{hline 5}{c TT}{hline 3}{c BT}{hline 10}{c TT}{hline 6}{c BT}{hline 15}{c RT}
     {c |}      v48  {c |}       v49  {c |}        v50   {c |}                v51   {c |}
     {c |}  {res}country  {txt}{c |}  {res}latitude  {txt}{c |}  {res}longitude   {txt}{c |}  {res}is_location_exact   {txt}{c |}
     {c LT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 6}{c TT}{hline 7}{c BT}{hline 8}{c TT}{hline 13}{c RT}
     {c |}            v52  {c |}        v53  {c |}           v54  {c |}        v55  {c |}
     {c |}  {res}property_type  {txt}{c |}  {res}room_type  {txt}{c |}  {res}accommodates  {txt}{c |}  {res}bathrooms  {txt}{c |}
     {c LT}{hline 10}{c TT}{hline 6}{c +}{hline 10}{c TT}{hline 2}{c BT}{hline 8}{c TT}{hline 7}{c BT}{hline 5}{c TT}{hline 7}{c RT}
     {c |}      v56 {c |}  v57 {c |}      v58 {c |}       v59 {c |}         v60 {c |}   v61 {c |}
     {c |} {res}bedrooms {txt}{c |} {res}beds {txt}{c |} {res}bed_type {txt}{c |} {res}amenities {txt}{c |} {res}square_feet {txt}{c |} {res}price {txt}{c |}
     {c LT}{hline 10}{c BT}{hline 6}{c BT}{c TT}{hline 9}{c BT}{hline 9}{c TT}{hline 1}{c BT}{hline 13}{c BT}{hline 7}{c RT}
     {c |}            v62   {c |}             v63   {c |}                v64    {c |}
     {c |}   {res}weekly_price   {txt}{c |}   {res}monthly_price   {txt}{c |}   {res}security_deposit    {txt}{c |}
     {c LT}{hline 18}{c BT}{c TT}{hline 18}{c BT}{hline 3}{c TT}{hline 19}{c RT}
     {c |}            v65    {c |}               v66    {c |}            v67    {c |}
     {c |}   {res}cleaning_fee    {txt}{c |}   {res}guests_included    {txt}{c |}   {res}extra_people    {txt}{c |}
     {c LT}{hline 19}{c +}{hline 19}{c TT}{hline 2}{c BT}{hline 19}{c RT}
     {c |}             v68   {c |}             v69   {c |}                v70   {c |}
     {c |}  {res}minimum_nights   {txt}{c |}  {res}maximum_nights   {txt}{c |}   {res}calendar_updated   {txt}{c |}
     {c LT}{hline 19}{c BT}{c TT}{hline 18}{c BT}{hline 1}{c TT}{hline 20}{c RT}
     {c |}               v71  {c |}              v72   {c |}              v73   {c |}
     {c |}  {res}has_availability  {txt}{c |}  {res}availability_30   {txt}{c |}  {res}availability_60   {txt}{c |}
     {c LT}{hline 17}{c TT}{hline 2}{c BT}{hline 16}{c TT}{hline 3}{c BT}{hline 20}{c RT}
     {c |}             v74 {c |}              v75  {c |}                   v76  {c |}
     {c |} {res}availability_90 {txt}{c |} {res}availability_365  {txt}{c |} {res}calendar_last_scraped  {txt}{c |}
     {c LT}{hline 17}{c BT}{hline 5}{c TT}{hline 13}{c BT}{hline 5}{c TT}{hline 18}{c RT}
     {c |}                 v77   {c |}            v78    {c |}           v79    {c |}
     {c |}   {res}number_of_reviews   {txt}{c |}   {res}first_review    {txt}{c |}   {res}last_review    {txt}{c |}
     {c LT}{hline 23}{c BT}{hline 5}{c TT}{hline 13}{c BT}{hline 18}{c RT}
     {c |}                     v80     {c |}                        v81     {c |}
     {c |}    {res}review_scores_rating     {txt}{c |}     {res}review_scores_accuracy     {txt}{c |}
     {c LT}{hline 29}{c BT}{hline 2}{c TT}{hline 29}{c RT}
     {c |}                         v82    {c |}                      v83    {c |}
     {c |}   {res}review_scores_cleanliness    {txt}{c |}    {res}review_scores_checkin    {txt}{c |}
     {c LT}{hline 32}{c BT}{c TT}{hline 28}{c RT}
     {c |}                           v84   {c |}                      v85   {c |}
     {c |}   {res}review_scores_communication   {txt}{c |}   {res}review_scores_location   {txt}{c |}
     {c LT}{hline 25}{c TT}{hline 7}{c BT}{hline 14}{c TT}{hline 13}{c RT}
     {c |}                   v86   {c |}                v87   {c |}       v88   {c |}
     {c |}   {res}review_scores_value   {txt}{c |}   {res}requires_license   {txt}{c |}   {res}license   {txt}{c |}
     {c LT}{hline 20}{c TT}{hline 4}{c BT}{hline 13}{c TT}{hline 8}{c BT}{hline 13}{c RT}
     {c |}                v89 {c |}              v90 {c |}                 v91  {c |}
     {c |} {res}jurisdiction_names {txt}{c |} {res}instant_bookable {txt}{c |} {res}cancellation_policy  {txt}{c |}
     {c LT}{hline 20}{c BT}{hline 18}{c BT}{hline 22}{c RT}
     {c |}                                          v92                 {c |}
     {c |}                {res}require_guest_profile_picture                 {txt}{c |}
     {c LT}{hline 62}{c RT}
     {c |}                                            v93               {c |}
     {c |}               {res}require_guest_phone_verification               {txt}{c |}
     {c LT}{hline 33}{c TT}{hline 20}{c TT}{hline 7}{c RT}
     {c |}                            v94  {c |}               v95  {c |}  v96  {c |}
     {c |} {res}calculated_host_listings_count  {txt}{c |} {res}reviews_per_month  {txt}{c |}  {res}     {txt}{c |}
     {c LT}{hline 5}{c TT}{hline 5}{c TT}{hline 5}{c TT}{hline 6}{c TT}{hline 6}{c TT}{hline 1}{c BT}{hline 4}{c TT}{hline 7}{c TT}{hline 7}{c +}{hline 7}{c RT}
     {c |} v97 {c |} v98 {c |} v99 {c |} v100 {c |} v101 {c |} v102 {c |} v103  {c |} v104  {c |} v105  {c |}
     {c |} {res}    {txt}{c |} {res}    {txt}{c |} {res}    {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}      {txt}{c |} {res}      {txt}{c |} {res}      {txt}{c |}
     {c LT}{hline 5}{c BT}{c TT}{hline 4}{c BT}{hline 1}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 4}{c BT}{hline 1}{c TT}{hline 5}{c BT}{c TT}{hline 6}{c RT}
     {c |} v106 {c |} v107 {c |} v108 {c |} v109 {c |} v110 {c |} v111 {c |} v112 {c |} v113 {c |} v114 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v115 {c |} v116 {c |} v117 {c |} v118 {c |} v119 {c |} v120 {c |} v121 {c |} v122 {c |} v123 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v124 {c |} v125 {c |} v126 {c |} v127 {c |} v128 {c |} v129 {c |} v130 {c |} v131 {c |} v132 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v133 {c |} v134 {c |} v135 {c |} v136 {c |} v137 {c |} v138 {c |} v139 {c |} v140 {c |} v141 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v142 {c |} v143 {c |} v144 {c |} v145 {c |} v146 {c |} v147 {c |} v148 {c |} v149 {c |} v150 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v151 {c |} v152 {c |} v153 {c |} v154 {c |} v155 {c |} v156 {c |} v157 {c |} v158 {c |} v159 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c BT}{hline 1}{c TT}{hline 4}{c BT}{hline 3}{c TT}{hline 2}{c BT}{hline 5}{c TT}{c BT}{hline 6}{c BT}{c TT}{hline 5}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 4}{c TT}{hline 1}{c BT}{hline 6}{c RT}
     {c |}  v160  {c |}  v161  {c |}  v162  {c |}  v163  {c |}  v164  {c |}  v165  {c |}  v166  {c |}
     {c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}
     {c BLC}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BRC}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. //Working directory -> change WD to another path
. pwd // get your working directory 
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. help pwd
{txt}
{com}. cd "D:\2025\CEU\Degree program\Coding for Economists\Assignment"
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. pwd
{res}D:\2025\CEU\Degree program\Coding for Economists\Assignment
{txt}
{com}. 
. // Create a log file 
. //capture log close // make sure nothing is open
. //log using "Coding_Final_Assignment", replace
. 
. 
. // import delimited "D:\2025\CEU\Degree program\Coding for Economists\Assignment\data\airbnb_raw.csv", clear
. 
. 
. browse
{txt}
{com}. list in 1

     {txt}{c TLC}{hline 4}{c TT}{hline 13}{c TT}{hline 11}{c TT}{hline 14}{c TT}{hline 6}{c TT}{hline 9}{c TRC}
  1. {c |} v1 {c |}          v2 {c |}        v3 {c |}           v4 {c |}   v5 {c |}      v6 {c |}
     {c |} {res}id {txt}{c |} {res}listing_url {txt}{c |} {res}scrape_id {txt}{c |} {res}last_scraped {txt}{c |} {res}name {txt}{c |} {res}summary {txt}{c |}
     {c LT}{hline 4}{c BT}{hline 8}{c TT}{hline 4}{c BT}{hline 11}{c BT}{hline 2}{c TT}{hline 11}{c BT}{hline 6}{c BT}{hline 9}{c RT}
     {c |}       v7    {c |}             v8    {c |}                     v9     {c |}
     {c |}    {res}space    {txt}{c |}    {res}description    {txt}{c |}    {res}experiences_offered     {txt}{c |}
     {c LT}{hline 13}{c BT}{hline 12}{c TT}{hline 6}{c BT}{hline 3}{c TT}{hline 12}{c TT}{hline 11}{c RT}
     {c |}                    v10   {c |}    v11   {c |}      v12   {c |}     v13   {c |}
     {c |}  {res}neighborhood_overview   {txt}{c |}  {res}notes   {txt}{c |}  {res}transit   {txt}{c |}  {res}access   {txt}{c |}
     {c LT}{hline 14}{c TT}{hline 11}{c BT}{hline 2}{c TT}{hline 7}{c BT}{hline 9}{c TT}{hline 2}{c BT}{hline 11}{c RT}
     {c |}         v14  {c |}         v15  {c |}            v16  {c |}         v17  {c |}
     {c |} {res}interaction  {txt}{c |} {res}house_rules  {txt}{c |}  {res}thumbnail_url  {txt}{c |}  {res}medium_url  {txt}{c |}
     {c LT}{hline 14}{c BT}{c TT}{hline 13}{c BT}{hline 5}{c TT}{hline 11}{c BT}{c TT}{hline 13}{c RT}
     {c |}          v18  {c |}             v19   {c |}      v20   {c |}       v21   {c |}
     {c |}  {res}picture_url  {txt}{c |}  {res}xl_picture_url   {txt}{c |}  {res}host_id   {txt}{c |}  {res}host_url   {txt}{c |}
     {c LT}{hline 13}{c TT}{hline 1}{c BT}{hline 12}{c TT}{hline 6}{c BT}{hline 10}{c TT}{hline 1}{c BT}{hline 13}{c RT}
     {c |}        v22  {c |}         v23  {c |}            v24  {c |}         v25   {c |}
     {c |}  {res}host_name  {txt}{c |}  {res}host_since  {txt}{c |}  {res}host_location  {txt}{c |}  {res}host_about   {txt}{c |}
     {c LT}{hline 13}{c BT}{hline 14}{c BT}{hline 1}{c TT}{hline 15}{c BT}{hline 15}{c RT}
     {c |}                     v26      {c |}                     v27       {c |}
     {c |}      {res}host_response_time      {txt}{c |}      {res}host_response_rate       {txt}{c |}
     {c LT}{hline 30}{c BT}{hline 1}{c TT}{hline 29}{c RT}
     {c |}                       v28      {c |}                    v29      {c |}
     {c |}      {res}host_acceptance_rate      {txt}{c |}      {res}host_is_superhost      {txt}{c |}
     {c LT}{hline 20}{c TT}{hline 11}{c BT}{hline 7}{c TT}{hline 21}{c RT}
     {c |}                v30 {c |}              v31  {c |}                v32  {c |}
     {c |} {res}host_thumbnail_url {txt}{c |} {res}host_picture_url  {txt}{c |} {res}host_neighbourhood  {txt}{c |}
     {c LT}{hline 20}{c BT}{hline 6}{c TT}{hline 12}{c BT}{hline 21}{c RT}
     {c |}                    v33    {c |}                          v34     {c |}
     {c |}    {res}host_listings_count    {txt}{c |}    {res}host_total_listings_count     {txt}{c |}
     {c LT}{hline 27}{c BT}{hline 1}{c TT}{hline 32}{c RT}
     {c |}                    v35      {c |}                       v36      {c |}
     {c |}     {res}host_verifications      {txt}{c |}      {res}host_has_profile_pic      {txt}{c |}
     {c LT}{hline 28}{c TT}{c BT}{hline 11}{c TT}{hline 20}{c RT}
     {c |}                      v37   {c |}      v38   {c |}             v39    {c |}
     {c |}   {res}host_identity_verified   {txt}{c |}   {res}street   {txt}{c |}   {res}neighbourhood    {txt}{c |}
     {c LT}{hline 24}{c TT}{hline 3}{c BT}{hline 12}{c BT}{hline 13}{c TT}{hline 6}{c RT}
     {c |}                    v40 {c |}                          v41 {c |}  v42 {c |}
     {c |} {res}neighbourhood_cleansed {txt}{c |} {res}neighbourhood_group_cleansed {txt}{c |} {res}city {txt}{c |}
     {c LT}{hline 7}{c TT}{hline 10}{c TT}{hline 5}{c BT}{hline 3}{c TT}{hline 17}{c TT}{hline 8}{c BT}{hline 6}{c RT}
     {c |}   v43 {c |}     v44  {c |}    v45  {c |}            v46  {c |}          v47  {c |}
     {c |} {res}state {txt}{c |} {res}zipcode  {txt}{c |} {res}market  {txt}{c |} {res}smart_location  {txt}{c |} {res}country_code  {txt}{c |}
     {c LT}{hline 7}{c BT}{hline 3}{c TT}{hline 6}{c BT}{hline 5}{c TT}{hline 3}{c BT}{hline 10}{c TT}{hline 6}{c BT}{hline 15}{c RT}
     {c |}      v48  {c |}       v49  {c |}        v50   {c |}                v51   {c |}
     {c |}  {res}country  {txt}{c |}  {res}latitude  {txt}{c |}  {res}longitude   {txt}{c |}  {res}is_location_exact   {txt}{c |}
     {c LT}{hline 11}{c BT}{hline 5}{c TT}{hline 6}{c BT}{hline 6}{c TT}{hline 7}{c BT}{hline 8}{c TT}{hline 13}{c RT}
     {c |}            v52  {c |}        v53  {c |}           v54  {c |}        v55  {c |}
     {c |}  {res}property_type  {txt}{c |}  {res}room_type  {txt}{c |}  {res}accommodates  {txt}{c |}  {res}bathrooms  {txt}{c |}
     {c LT}{hline 10}{c TT}{hline 6}{c +}{hline 10}{c TT}{hline 2}{c BT}{hline 8}{c TT}{hline 7}{c BT}{hline 5}{c TT}{hline 7}{c RT}
     {c |}      v56 {c |}  v57 {c |}      v58 {c |}       v59 {c |}         v60 {c |}   v61 {c |}
     {c |} {res}bedrooms {txt}{c |} {res}beds {txt}{c |} {res}bed_type {txt}{c |} {res}amenities {txt}{c |} {res}square_feet {txt}{c |} {res}price {txt}{c |}
     {c LT}{hline 10}{c BT}{hline 6}{c BT}{c TT}{hline 9}{c BT}{hline 9}{c TT}{hline 1}{c BT}{hline 13}{c BT}{hline 7}{c RT}
     {c |}            v62   {c |}             v63   {c |}                v64    {c |}
     {c |}   {res}weekly_price   {txt}{c |}   {res}monthly_price   {txt}{c |}   {res}security_deposit    {txt}{c |}
     {c LT}{hline 18}{c BT}{c TT}{hline 18}{c BT}{hline 3}{c TT}{hline 19}{c RT}
     {c |}            v65    {c |}               v66    {c |}            v67    {c |}
     {c |}   {res}cleaning_fee    {txt}{c |}   {res}guests_included    {txt}{c |}   {res}extra_people    {txt}{c |}
     {c LT}{hline 19}{c +}{hline 19}{c TT}{hline 2}{c BT}{hline 19}{c RT}
     {c |}             v68   {c |}             v69   {c |}                v70   {c |}
     {c |}  {res}minimum_nights   {txt}{c |}  {res}maximum_nights   {txt}{c |}   {res}calendar_updated   {txt}{c |}
     {c LT}{hline 19}{c BT}{c TT}{hline 18}{c BT}{hline 1}{c TT}{hline 20}{c RT}
     {c |}               v71  {c |}              v72   {c |}              v73   {c |}
     {c |}  {res}has_availability  {txt}{c |}  {res}availability_30   {txt}{c |}  {res}availability_60   {txt}{c |}
     {c LT}{hline 17}{c TT}{hline 2}{c BT}{hline 16}{c TT}{hline 3}{c BT}{hline 20}{c RT}
     {c |}             v74 {c |}              v75  {c |}                   v76  {c |}
     {c |} {res}availability_90 {txt}{c |} {res}availability_365  {txt}{c |} {res}calendar_last_scraped  {txt}{c |}
     {c LT}{hline 17}{c BT}{hline 5}{c TT}{hline 13}{c BT}{hline 5}{c TT}{hline 18}{c RT}
     {c |}                 v77   {c |}            v78    {c |}           v79    {c |}
     {c |}   {res}number_of_reviews   {txt}{c |}   {res}first_review    {txt}{c |}   {res}last_review    {txt}{c |}
     {c LT}{hline 23}{c BT}{hline 5}{c TT}{hline 13}{c BT}{hline 18}{c RT}
     {c |}                     v80     {c |}                        v81     {c |}
     {c |}    {res}review_scores_rating     {txt}{c |}     {res}review_scores_accuracy     {txt}{c |}
     {c LT}{hline 29}{c BT}{hline 2}{c TT}{hline 29}{c RT}
     {c |}                         v82    {c |}                      v83    {c |}
     {c |}   {res}review_scores_cleanliness    {txt}{c |}    {res}review_scores_checkin    {txt}{c |}
     {c LT}{hline 32}{c BT}{c TT}{hline 28}{c RT}
     {c |}                           v84   {c |}                      v85   {c |}
     {c |}   {res}review_scores_communication   {txt}{c |}   {res}review_scores_location   {txt}{c |}
     {c LT}{hline 25}{c TT}{hline 7}{c BT}{hline 14}{c TT}{hline 13}{c RT}
     {c |}                   v86   {c |}                v87   {c |}       v88   {c |}
     {c |}   {res}review_scores_value   {txt}{c |}   {res}requires_license   {txt}{c |}   {res}license   {txt}{c |}
     {c LT}{hline 20}{c TT}{hline 4}{c BT}{hline 13}{c TT}{hline 8}{c BT}{hline 13}{c RT}
     {c |}                v89 {c |}              v90 {c |}                 v91  {c |}
     {c |} {res}jurisdiction_names {txt}{c |} {res}instant_bookable {txt}{c |} {res}cancellation_policy  {txt}{c |}
     {c LT}{hline 20}{c BT}{hline 18}{c BT}{hline 22}{c RT}
     {c |}                                          v92                 {c |}
     {c |}                {res}require_guest_profile_picture                 {txt}{c |}
     {c LT}{hline 62}{c RT}
     {c |}                                            v93               {c |}
     {c |}               {res}require_guest_phone_verification               {txt}{c |}
     {c LT}{hline 33}{c TT}{hline 20}{c TT}{hline 7}{c RT}
     {c |}                            v94  {c |}               v95  {c |}  v96  {c |}
     {c |} {res}calculated_host_listings_count  {txt}{c |} {res}reviews_per_month  {txt}{c |}  {res}     {txt}{c |}
     {c LT}{hline 5}{c TT}{hline 5}{c TT}{hline 5}{c TT}{hline 6}{c TT}{hline 6}{c TT}{hline 1}{c BT}{hline 4}{c TT}{hline 7}{c TT}{hline 7}{c +}{hline 7}{c RT}
     {c |} v97 {c |} v98 {c |} v99 {c |} v100 {c |} v101 {c |} v102 {c |} v103  {c |} v104  {c |} v105  {c |}
     {c |} {res}    {txt}{c |} {res}    {txt}{c |} {res}    {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}      {txt}{c |} {res}      {txt}{c |} {res}      {txt}{c |}
     {c LT}{hline 5}{c BT}{c TT}{hline 4}{c BT}{hline 1}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 2}{c TT}{hline 4}{c BT}{hline 1}{c TT}{hline 5}{c BT}{c TT}{hline 6}{c RT}
     {c |} v106 {c |} v107 {c |} v108 {c |} v109 {c |} v110 {c |} v111 {c |} v112 {c |} v113 {c |} v114 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v115 {c |} v116 {c |} v117 {c |} v118 {c |} v119 {c |} v120 {c |} v121 {c |} v122 {c |} v123 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v124 {c |} v125 {c |} v126 {c |} v127 {c |} v128 {c |} v129 {c |} v130 {c |} v131 {c |} v132 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v133 {c |} v134 {c |} v135 {c |} v136 {c |} v137 {c |} v138 {c |} v139 {c |} v140 {c |} v141 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v142 {c |} v143 {c |} v144 {c |} v145 {c |} v146 {c |} v147 {c |} v148 {c |} v149 {c |} v150 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c +}{hline 6}{c RT}
     {c |} v151 {c |} v152 {c |} v153 {c |} v154 {c |} v155 {c |} v156 {c |} v157 {c |} v158 {c |} v159 {c |}
     {c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |} {res}     {txt}{c |}
     {c LT}{hline 6}{c BT}{hline 1}{c TT}{hline 4}{c BT}{hline 3}{c TT}{hline 2}{c BT}{hline 5}{c TT}{c BT}{hline 6}{c BT}{c TT}{hline 5}{c BT}{hline 2}{c TT}{hline 3}{c BT}{hline 4}{c TT}{hline 1}{c BT}{hline 6}{c RT}
     {c |}  v160  {c |}  v161  {c |}  v162  {c |}  v163  {c |}  v164  {c |}  v165  {c |}  v166  {c |}
     {c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}  {res}      {txt}{c |}
     {c BLC}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BT}{hline 8}{c BRC}

{com}. 
. clear
{txt}
{com}. 
. import delimited "D:\2025\CEU\Degree program\Coding for Economists\Assignment\data\airbnb_raw.csv", varnames(1)
{res}{text}(166 vars, 110,040 obs)

{com}. 
. destring d_price, replace ignore("$,")
{err}variable {bf}d_price{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. ds *price*
{txt}{col 1}price{col 15}weekly_price{col 29}monthly_pr~e

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. rename price d_price
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ price
{err}variable {bf}price{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. destring d_price, replace ignore("$,")
{txt}d_price: contains characters not specified in {res}ignore(){txt}; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. destring d_price, replace ignore("$")
{txt}d_price: contains characters not specified in {res}ignore(){txt}; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. destring d_price, replace ignore("$ ,")
{txt}d_price: contains characters not specified in {res}ignore(){txt}; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. replace d_price = subinstr(d_price, "$", "", .)
{txt}(37,280 real changes made)

{com}. 
. * 2. Removing the commas
. replace d_price = subinstr(d_price, ",", "", .)
{txt}(44 real changes made)

{com}. 
. * 3. Trimming spaces created
. replace d_price = trim(d_price)
{txt}(1 real change made)

{com}. 
. * 4. Destringing
. destring d_price, replace
{txt}d_price: contains nonnumeric characters; no {res}replace
{txt}
{com}. 
. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. replace d_price = subinstr(d_price, "$", "", .)
{txt}(0 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. replace d_price = subinstr(d_price, ",", "", .)
{txt}(0 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. replace d_price = trim(d_price)
{txt}(0 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. destring d_price, replace
{txt}d_price: contains nonnumeric characters; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. destring d_price, replace
{txt}d_price: contains nonnumeric characters; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. gen d_price_num = real(d_price)
{txt}(72,761 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price_num
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price, d_price_num
{err}option {bf:d_price_num} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price d_price_num
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. drop d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price d_price_num
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. rename d_price_num d_price
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price d_price_num
{err}variable {bf}d_price_num{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     37,279    92.20757    119.8845          8       7000
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. set linesize 255 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     37,279    92.20757    119.8845          8       7000
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ property_type

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
property_t~e {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ property_type

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
property_t~e {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse property_type
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. tab property_type

                          {txt}property_type {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                            The Opiates {c |}{res}          1        0.00        0.00
{txt} United Kingdom",GB,United Kingdom,51.. {c |}{res}          1        0.00        0.01
{txt}                     "24-hour check-in" {c |}{res}          1        0.00        0.01
{txt}                              Apartment {c |}{res}     26,331       70.62       70.63
{txt}                        Bed & Breakfast {c |}{res}        680        1.82       72.46
{txt}                                   Boat {c |}{res}         41        0.11       72.57
{txt}                         Boutique hotel {c |}{res}         32        0.09       72.65
{txt}                               Bungalow {c |}{res}         39        0.10       72.76
{txt}                                  Cabin {c |}{res}         22        0.06       72.82
{txt}                              Camper/RV {c |}{res}          4        0.01       72.83
{txt}                                 Castle {c |}{res}          3        0.01       72.83
{txt}                                   Cave {c |}{res}          1        0.00       72.84
{txt}                                 Chalet {c |}{res}          6        0.02       72.85
{txt}                            Condominium {c |}{res}         41        0.11       72.96
{txt}                                   Dorm {c |}{res}         81        0.22       73.18
{txt}                             Guesthouse {c |}{res}         65        0.17       73.36
{txt}                                Hangers {c |}{res}          1        0.00       73.36
{txt}                                 Hostel {c |}{res}         25        0.07       73.42
{txt}                                  House {c |}{res}      9,212       24.71       98.13
{txt}                                    Hut {c |}{res}          1        0.00       98.14
{txt}                                  Igloo {c |}{res}          1        0.00       98.14
{txt}                             Lighthouse {c |}{res}          1        0.00       98.14
{txt}                                   Loft {c |}{res}        158        0.42       98.57
{txt}                                  Other {c |}{res}        201        0.54       99.10
{txt}                          Parking Space {c |}{res}          1        0.00       99.11
{txt}                         Ryokan (Japan) {c |}{res}          1        0.00       99.11
{txt}                     Serviced apartment {c |}{res}         52        0.14       99.25
{txt}                                   Tent {c |}{res}          1        0.00       99.25
{txt}                              Townhouse {c |}{res}        268        0.72       99.97
{txt}                                  Villa {c |}{res}          8        0.02       99.99
{txt}                                   Yurt {c |}{res}          3        0.01      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}     37,283      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. hist d_price, bin (10)
{txt}(bin={res}10{txt}, start={res}8{txt}, width={res}699.2{txt})
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     37,279    92.20757    119.8845          8       7000
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. hist d_price number_of_reviews, bin (10)
{err}too many variables specified
{txt}{search r(103), local:r(103);}

end of do-file

{search r(103), local:r(103);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. graph box d_price, title("Distribution of Airbnb Prices") ytitle("Price ($)") box(1, lcolor(blue))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     37,279    92.20757    119.8845          8       7000
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. drop if d_price == "" | d_price == "NA"
{err}type mismatch
{txt}{search r(109), local:r(109);}

end of do-file

{search r(109), local:r(109);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. type d_price
{err}{p 0 4 2}
file d_price
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. type d_price
{err}{p 0 4 2}
file d_price
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     37,279    92.20757    119.8845          8       7000
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. type d_price
{err}{p 0 4 2}
file d_price
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. describe d_price

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:d_price        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. browse d_price
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. tab d_price

    {txt}d_price {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          8 {c |}{res}          1        0.00        0.00
{txt}          9 {c |}{res}          2        0.01        0.01
{txt}         10 {c |}{res}          9        0.02        0.03
{txt}         11 {c |}{res}          6        0.02        0.05
{txt}         12 {c |}{res}         10        0.03        0.08
{txt}         13 {c |}{res}         17        0.05        0.12
{txt}         14 {c |}{res}         36        0.10        0.22
{txt}         15 {c |}{res}         49        0.13        0.35
{txt}         16 {c |}{res}         27        0.07        0.42
{txt}         17 {c |}{res}         50        0.13        0.56
{txt}         18 {c |}{res}         77        0.21        0.76
{txt}         19 {c |}{res}         80        0.21        0.98
{txt}         20 {c |}{res}        313        0.84        1.82
{txt}         21 {c |}{res}         83        0.22        2.04
{txt}         22 {c |}{res}        160        0.43        2.47
{txt}         23 {c |}{res}        167        0.45        2.92
{txt}         24 {c |}{res}        164        0.44        3.36
{txt}         25 {c |}{res}        819        2.20        5.55
{txt}         26 {c |}{res}        152        0.41        5.96
{txt}         27 {c |}{res}        214        0.57        6.53
{txt}         28 {c |}{res}        311        0.83        7.37
{txt}         29 {c |}{res}        276        0.74        8.11
{txt}         30 {c |}{res}      1,292        3.47       11.57
{txt}         31 {c |}{res}        161        0.43       12.01
{txt}         32 {c |}{res}        285        0.76       12.77
{txt}         33 {c |}{res}        265        0.71       13.48
{txt}         34 {c |}{res}        181        0.49       13.97
{txt}         35 {c |}{res}      1,377        3.69       17.66
{txt}         36 {c |}{res}        216        0.58       18.24
{txt}         37 {c |}{res}        218        0.58       18.83
{txt}         38 {c |}{res}        321        0.86       19.69
{txt}         39 {c |}{res}        391        1.05       20.74
{txt}         40 {c |}{res}      1,632        4.38       25.11
{txt}         41 {c |}{res}        106        0.28       25.40
{txt}         42 {c |}{res}        234        0.63       26.03
{txt}         43 {c |}{res}        134        0.36       26.38
{txt}         44 {c |}{res}         98        0.26       26.65
{txt}         45 {c |}{res}      1,267        3.40       30.05
{txt}         46 {c |}{res}        101        0.27       30.32
{txt}         47 {c |}{res}        111        0.30       30.62
{txt}         48 {c |}{res}        206        0.55       31.17
{txt}         49 {c |}{res}        373        1.00       32.17
{txt}         50 {c |}{res}      1,624        4.36       36.52
{txt}         51 {c |}{res}         62        0.17       36.69
{txt}         52 {c |}{res}        107        0.29       36.98
{txt}         53 {c |}{res}         66        0.18       37.15
{txt}         54 {c |}{res}         74        0.20       37.35
{txt}         55 {c |}{res}        876        2.35       39.70
{txt}         56 {c |}{res}         71        0.19       39.89
{txt}         57 {c |}{res}        107        0.29       40.18
{txt}         58 {c |}{res}        119        0.32       40.50
{txt}         59 {c |}{res}        223        0.60       41.10
{txt}         60 {c |}{res}      1,240        3.33       44.42
{txt}         61 {c |}{res}         43        0.12       44.54
{txt}         62 {c |}{res}         95        0.25       44.79
{txt}         63 {c |}{res}         92        0.25       45.04
{txt}         64 {c |}{res}         77        0.21       45.25
{txt}         65 {c |}{res}        839        2.25       47.50
{txt}         66 {c |}{res}         55        0.15       47.65
{txt}         67 {c |}{res}         88        0.24       47.88
{txt}         68 {c |}{res}        129        0.35       48.23
{txt}         69 {c |}{res}        287        0.77       49.00
{txt}         70 {c |}{res}        963        2.58       51.58
{txt}         71 {c |}{res}         36        0.10       51.68
{txt}         72 {c |}{res}         92        0.25       51.92
{txt}         73 {c |}{res}         69        0.19       52.11
{txt}         74 {c |}{res}         59        0.16       52.27
{txt}         75 {c |}{res}        933        2.50       54.77
{txt}         76 {c |}{res}         43        0.12       54.89
{txt}         77 {c |}{res}         67        0.18       55.07
{txt}         78 {c |}{res}         85        0.23       55.29
{txt}         79 {c |}{res}        279        0.75       56.04
{txt}         80 {c |}{res}      1,122        3.01       59.05
{txt}         81 {c |}{res}         46        0.12       59.18
{txt}         82 {c |}{res}         80        0.21       59.39
{txt}         83 {c |}{res}         49        0.13       59.52
{txt}         84 {c |}{res}         43        0.12       59.64
{txt}         85 {c |}{res}        663        1.78       61.42
{txt}         86 {c |}{res}         59        0.16       61.57
{txt}         87 {c |}{res}         46        0.12       61.70
{txt}         88 {c |}{res}         80        0.21       61.91
{txt}         89 {c |}{res}        274        0.73       62.65
{txt}         90 {c |}{res}        879        2.36       65.00
{txt}         91 {c |}{res}         40        0.11       65.11
{txt}         92 {c |}{res}         53        0.14       65.25
{txt}         93 {c |}{res}         51        0.14       65.39
{txt}         94 {c |}{res}         48        0.13       65.52
{txt}         95 {c |}{res}        570        1.53       67.05
{txt}         96 {c |}{res}         56        0.15       67.20
{txt}         97 {c |}{res}         52        0.14       67.34
{txt}         98 {c |}{res}        123        0.33       67.67
{txt}         99 {c |}{res}        467        1.25       68.92
{txt}        100 {c |}{res}      1,425        3.82       72.74
{txt}        101 {c |}{res}         17        0.05       72.79
{txt}        102 {c |}{res}         41        0.11       72.90
{txt}        103 {c |}{res}         23        0.06       72.96
{txt}        104 {c |}{res}         28        0.08       73.04
{txt}        105 {c |}{res}        181        0.49       73.52
{txt}        106 {c |}{res}         40        0.11       73.63
{txt}        107 {c |}{res}         24        0.06       73.69
{txt}        108 {c |}{res}         35        0.09       73.79
{txt}        109 {c |}{res}         95        0.25       74.04
{txt}        110 {c |}{res}        606        1.63       75.67
{txt}        111 {c |}{res}         31        0.08       75.75
{txt}        112 {c |}{res}         26        0.07       75.82
{txt}        113 {c |}{res}         20        0.05       75.87
{txt}        114 {c |}{res}         24        0.06       75.94
{txt}        115 {c |}{res}        249        0.67       76.61
{txt}        116 {c |}{res}         22        0.06       76.67
{txt}        117 {c |}{res}         17        0.05       76.71
{txt}        118 {c |}{res}         33        0.09       76.80
{txt}        119 {c |}{res}        100        0.27       77.07
{txt}        120 {c |}{res}        960        2.58       79.64
{txt}        121 {c |}{res}         27        0.07       79.72
{txt}        122 {c |}{res}         32        0.09       79.80
{txt}        123 {c |}{res}         24        0.06       79.87
{txt}        124 {c |}{res}         22        0.06       79.92
{txt}        125 {c |}{res}        390        1.05       80.97
{txt}        126 {c |}{res}         11        0.03       81.00
{txt}        127 {c |}{res}         10        0.03       81.03
{txt}        128 {c |}{res}         29        0.08       81.10
{txt}        129 {c |}{res}        128        0.34       81.45
{txt}        130 {c |}{res}        425        1.14       82.59
{txt}        131 {c |}{res}         16        0.04       82.63
{txt}        132 {c |}{res}         16        0.04       82.67
{txt}        133 {c |}{res}         19        0.05       82.72
{txt}        134 {c |}{res}         10        0.03       82.75
{txt}        135 {c |}{res}        214        0.57       83.33
{txt}        136 {c |}{res}         13        0.03       83.36
{txt}        137 {c |}{res}         13        0.03       83.40
{txt}        138 {c |}{res}         17        0.05       83.44
{txt}        139 {c |}{res}         94        0.25       83.69
{txt}        140 {c |}{res}        379        1.02       84.71
{txt}        141 {c |}{res}          7        0.02       84.73
{txt}        142 {c |}{res}         15        0.04       84.77
{txt}        143 {c |}{res}         10        0.03       84.80
{txt}        144 {c |}{res}         22        0.06       84.85
{txt}        145 {c |}{res}        121        0.32       85.18
{txt}        146 {c |}{res}         13        0.03       85.21
{txt}        147 {c |}{res}         10        0.03       85.24
{txt}        148 {c |}{res}         16        0.04       85.28
{txt}        149 {c |}{res}        111        0.30       85.58
{txt}        150 {c |}{res}        933        2.50       88.08
{txt}        151 {c |}{res}          8        0.02       88.11
{txt}        152 {c |}{res}          9        0.02       88.13
{txt}        153 {c |}{res}          7        0.02       88.15
{txt}        154 {c |}{res}          5        0.01       88.16
{txt}        155 {c |}{res}         97        0.26       88.42
{txt}        156 {c |}{res}          8        0.02       88.44
{txt}        157 {c |}{res}         11        0.03       88.47
{txt}        158 {c |}{res}         12        0.03       88.51
{txt}        159 {c |}{res}         55        0.15       88.65
{txt}        160 {c |}{res}        253        0.68       89.33
{txt}        161 {c |}{res}          8        0.02       89.35
{txt}        162 {c |}{res}         14        0.04       89.39
{txt}        163 {c |}{res}          8        0.02       89.41
{txt}        164 {c |}{res}         10        0.03       89.44
{txt}        165 {c |}{res}        103        0.28       89.72
{txt}        166 {c |}{res}          5        0.01       89.73
{txt}        167 {c |}{res}         11        0.03       89.76
{txt}        168 {c |}{res}         12        0.03       89.79
{txt}        169 {c |}{res}         43        0.12       89.91
{txt}        170 {c |}{res}        152        0.41       90.31
{txt}        171 {c |}{res}         10        0.03       90.34
{txt}        172 {c |}{res}         11        0.03       90.37
{txt}        173 {c |}{res}          4        0.01       90.38
{txt}        174 {c |}{res}          3        0.01       90.39
{txt}        175 {c |}{res}        209        0.56       90.95
{txt}        176 {c |}{res}          3        0.01       90.96
{txt}        177 {c |}{res}          7        0.02       90.98
{txt}        178 {c |}{res}         11        0.03       91.01
{txt}        179 {c |}{res}         42        0.11       91.12
{txt}        180 {c |}{res}        239        0.64       91.76
{txt}        181 {c |}{res}          2        0.01       91.76
{txt}        182 {c |}{res}          4        0.01       91.78
{txt}        183 {c |}{res}          3        0.01       91.78
{txt}        184 {c |}{res}          6        0.02       91.80
{txt}        185 {c |}{res}         88        0.24       92.04
{txt}        186 {c |}{res}          4        0.01       92.05
{txt}        187 {c |}{res}          4        0.01       92.06
{txt}        188 {c |}{res}         11        0.03       92.09
{txt}        189 {c |}{res}         30        0.08       92.17
{txt}        190 {c |}{res}        108        0.29       92.46
{txt}        191 {c |}{res}          9        0.02       92.48
{txt}        192 {c |}{res}          5        0.01       92.49
{txt}        193 {c |}{res}          3        0.01       92.50
{txt}        194 {c |}{res}          5        0.01       92.52
{txt}        195 {c |}{res}        116        0.31       92.83
{txt}        196 {c |}{res}          6        0.02       92.84
{txt}        197 {c |}{res}          7        0.02       92.86
{txt}        198 {c |}{res}         12        0.03       92.89
{txt}        199 {c |}{res}         52        0.14       93.03
{txt}        200 {c |}{res}        483        1.30       94.33
{txt}        201 {c |}{res}          5        0.01       94.34
{txt}        202 {c |}{res}          3        0.01       94.35
{txt}        203 {c |}{res}          5        0.01       94.36
{txt}        204 {c |}{res}          7        0.02       94.38
{txt}        205 {c |}{res}         17        0.05       94.43
{txt}        206 {c |}{res}          4        0.01       94.44
{txt}        207 {c |}{res}          5        0.01       94.45
{txt}        208 {c |}{res}          2        0.01       94.46
{txt}        209 {c |}{res}          6        0.02       94.47
{txt}        210 {c |}{res}         46        0.12       94.60
{txt}        211 {c |}{res}          2        0.01       94.60
{txt}        212 {c |}{res}          5        0.01       94.62
{txt}        214 {c |}{res}          4        0.01       94.63
{txt}        215 {c |}{res}         33        0.09       94.72
{txt}        216 {c |}{res}          2        0.01       94.72
{txt}        217 {c |}{res}          3        0.01       94.73
{txt}        218 {c |}{res}          5        0.01       94.74
{txt}        219 {c |}{res}         16        0.04       94.79
{txt}        220 {c |}{res}        125        0.34       95.12
{txt}        222 {c |}{res}          5        0.01       95.13
{txt}        223 {c |}{res}          2        0.01       95.14
{txt}        224 {c |}{res}          1        0.00       95.14
{txt}        225 {c |}{res}         89        0.24       95.38
{txt}        226 {c |}{res}          1        0.00       95.38
{txt}        227 {c |}{res}          3        0.01       95.39
{txt}        228 {c |}{res}          4        0.01       95.40
{txt}        229 {c |}{res}         10        0.03       95.43
{txt}        230 {c |}{res}         41        0.11       95.54
{txt}        231 {c |}{res}          2        0.01       95.54
{txt}        232 {c |}{res}          4        0.01       95.56
{txt}        233 {c |}{res}          2        0.01       95.56
{txt}        235 {c |}{res}         20        0.05       95.61
{txt}        236 {c |}{res}          1        0.00       95.62
{txt}        237 {c |}{res}          4        0.01       95.63
{txt}        238 {c |}{res}          1        0.00       95.63
{txt}        239 {c |}{res}          9        0.02       95.65
{txt}        240 {c |}{res}         40        0.11       95.76
{txt}        241 {c |}{res}          1        0.00       95.76
{txt}        242 {c |}{res}          1        0.00       95.77
{txt}        243 {c |}{res}          2        0.01       95.77
{txt}        244 {c |}{res}          3        0.01       95.78
{txt}        245 {c |}{res}         28        0.08       95.86
{txt}        247 {c |}{res}          1        0.00       95.86
{txt}        248 {c |}{res}          2        0.01       95.86
{txt}        249 {c |}{res}         28        0.08       95.94
{txt}        250 {c |}{res}        306        0.82       96.76
{txt}        251 {c |}{res}          1        0.00       96.76
{txt}        252 {c |}{res}          1        0.00       96.76
{txt}        253 {c |}{res}          2        0.01       96.77
{txt}        254 {c |}{res}          2        0.01       96.78
{txt}        255 {c |}{res}          9        0.02       96.80
{txt}        256 {c |}{res}          2        0.01       96.81
{txt}        257 {c |}{res}          1        0.00       96.81
{txt}        258 {c |}{res}          2        0.01       96.81
{txt}        259 {c |}{res}          7        0.02       96.83
{txt}        260 {c |}{res}         29        0.08       96.91
{txt}        261 {c |}{res}          1        0.00       96.91
{txt}        262 {c |}{res}          1        0.00       96.92
{txt}        264 {c |}{res}          3        0.01       96.92
{txt}        265 {c |}{res}         10        0.03       96.95
{txt}        266 {c |}{res}          2        0.01       96.96
{txt}        267 {c |}{res}          1        0.00       96.96
{txt}        268 {c |}{res}          1        0.00       96.96
{txt}        269 {c |}{res}          5        0.01       96.97
{txt}        270 {c |}{res}         17        0.05       97.02
{txt}        272 {c |}{res}          2        0.01       97.03
{txt}        273 {c |}{res}          1        0.00       97.03
{txt}        274 {c |}{res}          1        0.00       97.03
{txt}        275 {c |}{res}         52        0.14       97.17
{txt}        279 {c |}{res}          6        0.02       97.19
{txt}        280 {c |}{res}         48        0.13       97.31
{txt}        281 {c |}{res}          1        0.00       97.32
{txt}        282 {c |}{res}          1        0.00       97.32
{txt}        283 {c |}{res}          4        0.01       97.33
{txt}        285 {c |}{res}         14        0.04       97.37
{txt}        286 {c |}{res}          2        0.01       97.37
{txt}        287 {c |}{res}          1        0.00       97.38
{txt}        288 {c |}{res}          4        0.01       97.39
{txt}        290 {c |}{res}         22        0.06       97.45
{txt}        294 {c |}{res}          1        0.00       97.45
{txt}        295 {c |}{res}         35        0.09       97.54
{txt}        296 {c |}{res}          1        0.00       97.55
{txt}        297 {c |}{res}          3        0.01       97.55
{txt}        299 {c |}{res}         28        0.08       97.63
{txt}        300 {c |}{res}        151        0.41       98.03
{txt}        301 {c |}{res}          1        0.00       98.04
{txt}        302 {c |}{res}          1        0.00       98.04
{txt}        305 {c |}{res}          3        0.01       98.05
{txt}        306 {c |}{res}          1        0.00       98.05
{txt}        307 {c |}{res}          2        0.01       98.06
{txt}        308 {c |}{res}          1        0.00       98.06
{txt}        309 {c |}{res}          1        0.00       98.06
{txt}        310 {c |}{res}         10        0.03       98.09
{txt}        313 {c |}{res}          1        0.00       98.09
{txt}        315 {c |}{res}          5        0.01       98.10
{txt}        317 {c |}{res}          1        0.00       98.11
{txt}        320 {c |}{res}         24        0.06       98.17
{txt}        325 {c |}{res}         20        0.05       98.22
{txt}        326 {c |}{res}          5        0.01       98.24
{txt}        330 {c |}{res}          8        0.02       98.26
{txt}        332 {c |}{res}          1        0.00       98.26
{txt}        333 {c |}{res}          1        0.00       98.26
{txt}        335 {c |}{res}          3        0.01       98.27
{txt}        339 {c |}{res}          2        0.01       98.28
{txt}        340 {c |}{res}         11        0.03       98.31
{txt}        342 {c |}{res}          1        0.00       98.31
{txt}        343 {c |}{res}          3        0.01       98.32
{txt}        345 {c |}{res}         14        0.04       98.36
{txt}        349 {c |}{res}          6        0.02       98.37
{txt}        350 {c |}{res}        105        0.28       98.65
{txt}        352 {c |}{res}          2        0.01       98.66
{txt}        357 {c |}{res}          3        0.01       98.67
{txt}        359 {c |}{res}          1        0.00       98.67
{txt}        360 {c |}{res}          7        0.02       98.69
{txt}        363 {c |}{res}          1        0.00       98.69
{txt}        364 {c |}{res}          1        0.00       98.69
{txt}        365 {c |}{res}          1        0.00       98.70
{txt}        366 {c |}{res}          1        0.00       98.70
{txt}        367 {c |}{res}          2        0.01       98.70
{txt}        369 {c |}{res}          1        0.00       98.71
{txt}        370 {c |}{res}          3        0.01       98.72
{txt}        372 {c |}{res}          1        0.00       98.72
{txt}        375 {c |}{res}         12        0.03       98.75
{txt}        377 {c |}{res}          1        0.00       98.75
{txt}        379 {c |}{res}          1        0.00       98.76
{txt}        380 {c |}{res}          7        0.02       98.77
{txt}        383 {c |}{res}          1        0.00       98.78
{txt}        385 {c |}{res}          5        0.01       98.79
{txt}        386 {c |}{res}          1        0.00       98.79
{txt}        389 {c |}{res}          1        0.00       98.80
{txt}        390 {c |}{res}          9        0.02       98.82
{txt}        392 {c |}{res}          1        0.00       98.82
{txt}        395 {c |}{res}         22        0.06       98.88
{txt}        397 {c |}{res}          2        0.01       98.89
{txt}        398 {c |}{res}          2        0.01       98.89
{txt}        399 {c |}{res}         10        0.03       98.92
{txt}        400 {c |}{res}         66        0.18       99.10
{txt}        404 {c |}{res}          1        0.00       99.10
{txt}        405 {c |}{res}          1        0.00       99.10
{txt}        408 {c |}{res}          3        0.01       99.11
{txt}        414 {c |}{res}          3        0.01       99.12
{txt}        415 {c |}{res}          2        0.01       99.12
{txt}        418 {c |}{res}          1        0.00       99.13
{txt}        420 {c |}{res}          4        0.01       99.14
{txt}        422 {c |}{res}          1        0.00       99.14
{txt}        424 {c |}{res}          1        0.00       99.14
{txt}        425 {c |}{res}         18        0.05       99.19
{txt}        426 {c |}{res}          1        0.00       99.19
{txt}        428 {c |}{res}          1        0.00       99.20
{txt}        430 {c |}{res}          2        0.01       99.20
{txt}        434 {c |}{res}          1        0.00       99.20
{txt}        435 {c |}{res}          2        0.01       99.21
{txt}        440 {c |}{res}          2        0.01       99.21
{txt}        449 {c |}{res}          2        0.01       99.22
{txt}        450 {c |}{res}         34        0.09       99.31
{txt}        453 {c |}{res}          1        0.00       99.31
{txt}        455 {c |}{res}          1        0.00       99.32
{txt}        459 {c |}{res}          1        0.00       99.32
{txt}        460 {c |}{res}          2        0.01       99.32
{txt}        462 {c |}{res}          1        0.00       99.33
{txt}        470 {c |}{res}          1        0.00       99.33
{txt}        475 {c |}{res}          5        0.01       99.34
{txt}        476 {c |}{res}          1        0.00       99.35
{txt}        480 {c |}{res}          2        0.01       99.35
{txt}        484 {c |}{res}          1        0.00       99.35
{txt}        485 {c |}{res}          4        0.01       99.36
{txt}        488 {c |}{res}          1        0.00       99.37
{txt}        489 {c |}{res}          1        0.00       99.37
{txt}        490 {c |}{res}          2        0.01       99.37
{txt}        491 {c |}{res}          1        0.00       99.38
{txt}        495 {c |}{res}          6        0.02       99.39
{txt}        496 {c |}{res}          1        0.00       99.40
{txt}        499 {c |}{res}          6        0.02       99.41
{txt}        500 {c |}{res}         31        0.08       99.50
{txt}        501 {c |}{res}          1        0.00       99.50
{txt}        507 {c |}{res}          1        0.00       99.50
{txt}        510 {c |}{res}          1        0.00       99.50
{txt}        515 {c |}{res}          1        0.00       99.51
{txt}        520 {c |}{res}          2        0.01       99.51
{txt}        521 {c |}{res}          1        0.00       99.51
{txt}        525 {c |}{res}          7        0.02       99.53
{txt}        530 {c |}{res}          2        0.01       99.54
{txt}        543 {c |}{res}          1        0.00       99.54
{txt}        544 {c |}{res}          1        0.00       99.54
{txt}        545 {c |}{res}          3        0.01       99.55
{txt}        547 {c |}{res}          1        0.00       99.55
{txt}        550 {c |}{res}         17        0.05       99.60
{txt}        555 {c |}{res}          1        0.00       99.60
{txt}        567 {c |}{res}          1        0.00       99.61
{txt}        569 {c |}{res}          1        0.00       99.61
{txt}        570 {c |}{res}          2        0.01       99.61
{txt}        571 {c |}{res}          1        0.00       99.62
{txt}        572 {c |}{res}          1        0.00       99.62
{txt}        573 {c |}{res}          1        0.00       99.62
{txt}        575 {c |}{res}          1        0.00       99.62
{txt}        578 {c |}{res}          1        0.00       99.63
{txt}        579 {c |}{res}          1        0.00       99.63
{txt}        580 {c |}{res}          1        0.00       99.63
{txt}        585 {c |}{res}          1        0.00       99.64
{txt}        590 {c |}{res}          1        0.00       99.64
{txt}        595 {c |}{res}          1        0.00       99.64
{txt}        600 {c |}{res}         14        0.04       99.68
{txt}        613 {c |}{res}          1        0.00       99.68
{txt}        620 {c |}{res}          1        0.00       99.68
{txt}        625 {c |}{res}          2        0.01       99.69
{txt}        630 {c |}{res}          1        0.00       99.69
{txt}        650 {c |}{res}          8        0.02       99.71
{txt}        653 {c |}{res}          1        0.00       99.72
{txt}        663 {c |}{res}          1        0.00       99.72
{txt}        664 {c |}{res}          1        0.00       99.72
{txt}        666 {c |}{res}          1        0.00       99.72
{txt}        675 {c |}{res}          3        0.01       99.73
{txt}        680 {c |}{res}          1        0.00       99.73
{txt}        682 {c |}{res}          1        0.00       99.74
{txt}        685 {c |}{res}          1        0.00       99.74
{txt}        688 {c |}{res}          1        0.00       99.74
{txt}        695 {c |}{res}          1        0.00       99.75
{txt}        699 {c |}{res}          1        0.00       99.75
{txt}        700 {c |}{res}          5        0.01       99.76
{txt}        702 {c |}{res}          1        0.00       99.76
{txt}        715 {c |}{res}          2        0.01       99.77
{txt}        734 {c |}{res}          2        0.01       99.77
{txt}        750 {c |}{res}          8        0.02       99.80
{txt}        755 {c |}{res}          1        0.00       99.80
{txt}        785 {c |}{res}          1        0.00       99.80
{txt}        799 {c |}{res}          2        0.01       99.81
{txt}        800 {c |}{res}          6        0.02       99.82
{txt}        810 {c |}{res}          1        0.00       99.83
{txt}        816 {c |}{res}          1        0.00       99.83
{txt}        830 {c |}{res}          1        0.00       99.83
{txt}        834 {c |}{res}          1        0.00       99.83
{txt}        835 {c |}{res}          1        0.00       99.84
{txt}        849 {c |}{res}          1        0.00       99.84
{txt}        850 {c |}{res}          4        0.01       99.85
{txt}        857 {c |}{res}          1        0.00       99.85
{txt}        870 {c |}{res}          1        0.00       99.86
{txt}        875 {c |}{res}          1        0.00       99.86
{txt}        897 {c |}{res}          1        0.00       99.86
{txt}        900 {c |}{res}          2        0.01       99.87
{txt}        901 {c |}{res}          2        0.01       99.87
{txt}        925 {c |}{res}          1        0.00       99.87
{txt}        950 {c |}{res}          1        0.00       99.88
{txt}        972 {c |}{res}          1        0.00       99.88
{txt}        990 {c |}{res}          1        0.00       99.88
{txt}        999 {c |}{res}          1        0.00       99.88
{txt}       1000 {c |}{res}         10        0.03       99.91
{txt}       1010 {c |}{res}          1        0.00       99.91
{txt}       1015 {c |}{res}          1        0.00       99.92
{txt}       1050 {c |}{res}          1        0.00       99.92
{txt}       1075 {c |}{res}          1        0.00       99.92
{txt}       1100 {c |}{res}          1        0.00       99.92
{txt}       1150 {c |}{res}          1        0.00       99.93
{txt}       1200 {c |}{res}          2        0.01       99.93
{txt}       1490 {c |}{res}          1        0.00       99.94
{txt}       1500 {c |}{res}          3        0.01       99.94
{txt}       1570 {c |}{res}          1        0.00       99.95
{txt}       1795 {c |}{res}          1        0.00       99.95
{txt}       1800 {c |}{res}          1        0.00       99.95
{txt}       2000 {c |}{res}          3        0.01       99.96
{txt}       2100 {c |}{res}          1        0.00       99.96
{txt}       2500 {c |}{res}          4        0.01       99.97
{txt}       3500 {c |}{res}          2        0.01       99.98
{txt}       4000 {c |}{res}          1        0.00       99.98
{txt}       5000 {c |}{res}          5        0.01       99.99
{txt}       7000 {c |}{res}          2        0.01      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     37,279      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. drop if d_price == "" | d_price == "NA" | d_price >220
{err}type mismatch
{txt}{search r(109), local:r(109);}

end of do-file

{search r(109), local:r(109);}

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. drop if missing(d_price) | d_price > 220
{txt}(74,580 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     35,460    77.51605    45.36062          8        220
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. graph box d_price, title("Distribution of Airbnb Prices") ytitle("Price ($)") box(1, lcolor(blue))
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price number_of_reviews

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     35,460    77.51605    45.36062          8        220
{txt}number_of_~s {c |}{res}          0
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. summ d_price

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}d_price {c |}{res}     35,460    77.51605    45.36062          8        220
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\Shehryar\AppData\Local\Temp\STD398c_000000.tmp"
{txt}
{com}. save airbnb_clean.dta, replace
{txt}(note: file airbnb_clean.dta not found)
file airbnb_clean.dta saved

{com}. 
{txt}end of do-file

{com}. exit, clear
